app/views/profiles/index.html.erb

	<% if user_signed_in? %>
		<% if Profile.exists?(:user_id => current_user.id) %>
---
SELECT "profiles".* FROM "profiles" WHERE (sex LIKE '%Geek%' AND seeks LIKE '%Nerdette%')

	  <% else %>
		<% if Friendship.find(:all, :conditions => {:friend_id => profile.user_id, :user_id => current_user.id}).empty? == false %>
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = 1 AND "friendships"."user_id" = 3
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1