app/views/profiles/show.html.erb

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
---
		<div id='profile-div'>
		  <h3><%= Profile.find(:all, :conditions => { :user_id => friendship.friend_id }).first.name %></h3>