app/controllers/friendships_controller.rb

INSERT INTO "friendships" ("created_at", "friend_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 23 Mar 2013 18:29:19 UTC +00:00], ["friend_id", 1], ["updated_at", Sat, 23 Mar 2013 18:29:19 UTC +00:00], ["user_id", 2]]
---
  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 1]]
---
  def destroy
    @friendship = Friendship.find(params[:id])
    @friendship.destroy