app/controllers/profiles_controller.rb

  def index

	@profiles = Profile.search(params[:search], params[:role])
---
SELECT "profiles".* FROM "profiles" WHERE (sex LIKE '%Geek%' AND seeks LIKE '%Nerdette%')

  def show
    @profile = Profile.find(params[:id])
	@friendships  = Friendship.all
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."profile_id" = 6

  def edit
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @profile = Profile.new(params[:profile])

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("age", "created_at", "eyes", "from", "height", "homepage", "interests", "name", "photo", "seeks", "sex", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "profiles" SET "sex" = 'Geek', "seeks" = 'Nerdette', "photo" = 'rails.png', "updated_at" = '2013-03-17 18:41:51.512806' WHERE "profiles"."id" = 1

  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 2]]